app/Http/Controllers/HomeController.php

    public function index()
    {

        //$products=Product::inRandomOrder()->paginate(6);
        $products=product::
            orderBy('id','desc')
            ->join('categories', 'products.so_categories_id', '=', 'categories.id')

            ->select(
                    'products.*',
                    'categories.slug as category_slug' ,
                    'categories.name as category_name'
        )->get();
        //$products=Product::orderBy('id','desc')->get();
        $random=$products->random(6);
        $recientes=$products->take(5);
        $economicos=$products->sortBy('price')->take(5);
        //dd($mas_apartados->random(1));

        $mas_apartados=ReservedProduct::orderBy('id','desc')->where('status',2)->limit(50)->get();
        $mas_apartados=$mas_apartados->groupBy('so_products_id');
        $mas_apartados = $mas_apartados->map(function ($item, $key) {
            return $item->first();
        });
---
select `so_products`.*, `so_categories`.`slug` as `category_slug`, `so_categories`.`name` as `category_name` from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` order by `id` desc
select * from `so_reserved_product` where `status` = '2' order by `id` desc limit 50