app/Http/Controllers/ProductController.php

    public function product($slug_ca,$slug_pro=null)
    {


        $products=Product::
            orderBy('id','desc')
            ->join('categories', 'products.so_categories_id', '=', 'categories.id')
            ->where('products.activo',1)
            ->select(
                    'products.*',
                    'categories.slug as category_slug' ,
                    'categories.name as category_name'
            );

        $categories=$products;
        $categories=$categories->get()->unique('category_name');

        //dd($categories);

        $economicos=$products;
        $economicos=$economicos->where('categories.slug',$slug_ca)->get()->sortBy('price')->take(5);
        //list
        if (!$slug_pro) {
            $products=$products->where('categories.slug',$slug_ca)->paginate(9);
            $products->search=$products->first()->category_name;
            return view('products.list',compact('products','economicos' ,'categories'));

        //detail
        }else{
            $products=$products->where('categories.slug',$slug_ca)->inRandomOrder()->get();
---
select `so_products`.*, `so_categories`.`slug` as `category_slug`, `so_categories`.`name` as `category_name` from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_categories`.`slug` = 'anillos' order by `id` desc
select count(*) as aggregate from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_categories`.`slug` = 'anillos'
select `so_products`.*, `so_categories`.`slug` as `category_slug`, `so_categories`.`name` as `category_name` from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_categories`.`slug` = 'collares' order by `id` desc
select `so_products`.*, `so_categories`.`slug` as `category_slug`, `so_categories`.`name` as `category_name` from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_categories`.`slug` = 'Cadenas' order by `id` desc

    public function search(Request $request)
    {
        //dd($request->search);
        $products=product::
            orderBy('id','desc')
            ->join('categories', 'products.so_categories_id', '=', 'categories.id')
            ->where('products.activo',1)
            ->select(
                    'products.*',
                    'categories.slug as category_slug' ,
                    'categories.name as category_name'
            );

        $categories=$products;
        $categories=$categories->get()->unique('category_name');

        $economicos=$products;
        $economicos=$economicos->get()->sortBy('price')->take(5);
        $products=$products->where(function($q) use ($request) {
          $q->where('products.title','like',"%$request->search%")
            ->orWhere('products.content','like',"%$request->search%");
        })->paginate(9);
---
select `so_products`.*, `so_categories`.`slug` as `category_slug`, `so_categories`.`name` as `category_name` from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_products`.`title` like '%anillo%' order by `id` desc limit 9 offset 18
select count(*) as aggregate from `so_products` inner join `so_categories` on `so_products`.`so_categories_id` = `so_categories`.`id` where `so_products`.`title` like '%anillo%'