app/Http/Controllers/dashboard/ProductController.php

select * from `so_products` where `deleted_at` is null
---
    public function index()
    {
        $products=Product::whereNull('deleted_at')->get();

insert into `so_products` (`title`, `price`, `content`, `so_categories_id`, `quantity`, `quantity_min`, `activo`, `slug`, `img`, `updated_at`, `created_at`) values ('123', '123', '<p>123</p>', '4', '123', '123', '0', '123', '-', '2018-05-28 21:39:04', '2018-05-28 21:39:04')
---
    public function store(Request $request,Product $producto)
    {
        $v = Validator::make($request->all(), [
            'title'         =>'required',
            'content'       =>'required',
            'price'         =>'required|min:0',
            'quantity'      =>'required|min:0',
            'quantity_min'  =>'required|min:0',
            'images'        =>'required',
            'images.*'      => 'image|mimes:jpeg,jpg,png|max:1000',
        ]);

        if ($v->fails())
        {
            return redirect()->back()->withInput()->withErrors($v->errors());
        }

        $files=$request->file('images');
        $product= (new Product)->fill($request->all());
        $product->slug=str_slug($request->title);
        $product->img="-";
        $product->save();

select * from `so_products` where `so_products`.`id` = '4' limit 1
---
    public function edit($id)
    {
        $edit=true;
        $product=Product::findOrFail($id);

select * from `so_products` where `so_products`.`id` = '4' limit 1
---
    public function update(Request $request, $id)
    {
        $v = Validator::make($request->all(), [
            'title'=>'required',
            'content'=>'required',
            'price'=>'required|min:0',
            'quantity'=>'required|min:0',
            'quantity_min'=>'required|min:0',
            'images.*' => ' image|mimes:jpeg,jpg,png|max:1000',
        ]);

        if ($v->fails())
        {
            return redirect()->back()->withInput()->withErrors($v->errors());
        }


        $product= Product::find($id)->fill($request->all());

select * from `so_products` where `so_products`.`id` = '199' limit 1
update `so_products` set `deleted_at` = '2018-05-28 22:46:07', `updated_at` = '2018-05-28 22:46:07' where `id` = '199'
---
    public function destroy($id)
    {
        $product=Product::findOrFail($id);
        $product->deleted_at=date('Y-m-d H:i:s');
        $product->save();

select * from `so_images` where `so_images`.`id` = '18' limit 1
delete from `so_images` where `id` = '18'
---
    public function delete_img($id)
    {
        $img=Image::findOrFail($id);

        $img->delete();

insert into `so_images` (`img`, `thum`, `so_products_id`, `updated_at`, `created_at`) values ('https://segadeoro.s3.us-east-2.amazonaws.com/segadeoro/img/segadeoro_dd.jpg', 'https://segadeoro.s3.us-east-2.amazonaws.com/segadeoro/thum/segadeoro_dd.jpg', '4', '2018-05-28 21:46:01', '2018-05-28 21:46:01')
---
    public function upload_img($files,$title,$product)
    {
        if ($files){
            foreach ($files as $value) {

                $img_normal=\Image::make($value)->stream('jpg',60);
                $img_thum=\Image::make($value)->resize(365,260)->stream('jpg',60);
                //$filename='segadeoro/img/segadeoro_'.uniqid(5)."_".str_slug($request->title).'.jpg';
                $filename_normal='segadeoro/img/segadeoro_dd.jpg';
                $filename_thum='segadeoro/thum/segadeoro_dd.jpg';

                Storage::put($filename_normal,$img_normal->__toString(),'public');
                Storage::put($filename_thum,$img_thum->__toString(),'public');

                $filename_normal=Storage::url($filename_normal);
                $filename_thum=Storage::url($filename_thum);
                $image= new Image;
                $image->img=$filename_normal;
                $image->thum=$filename_thum;
                $image->product()->associate($product);
                $image->save();