app/Http/Controllers/dashboard/SliderController.php

select * from `so_sliders`
---
    public function index()
    {
        $sliders=Slider::get();

insert into `so_sliders` (`title`, `href`, `content`, `img`, `updated_at`, `created_at`) values ('asd', 'asd', '<h1 style=\"line-height: 1;te\">Ofertas <br>en <br>diamantes<br></h1>', 'https://segadeoro.s3.us-east-2.amazonaws.com/segadeoro/sliders/segadeoro_dd.jpg', '2018-05-29 00:22:36', '2018-05-29 00:22:36')
---
    public function store(Request $request,Slider $slider)
    {
        $v = Validator::make($request->all(), [
            'title'=>'required',
            'content'=>'required',
            'href'=>'required',
            'img' => ' required|image|mimes:jpeg,jpg,png|max:1000',
        ]);

        if ($v->fails())
        {
            return redirect()->back()->withInput()->withErrors($v->errors());
        }
        $files=$request->file('img');
        $slider=$slider->fill($request->all());
        $slider->img=$this->upload_img($files,$slider->title);
        $slider->save();